# Correlation

In [9]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from scipy.stats import norm

from empiricaldist import Pmf, Cdf

In [4]:
brfss = pd.read_hdf('../datasets/brfss.hdf5','brfss')

In [5]:
columns = ['HTM4','WTKG3','AGE']
subset = brfss[columns]

In [6]:
subset

         HTM4   WTKG3   AGE
96230   160.0   60.33  47.0
244920  163.0   58.97  89.5
57312   163.0   72.57  42.0
32573   165.0   74.84  32.0
355929  170.0  108.86  32.0
...       ...     ...   ...
376876  173.0   97.52  32.0
201499  170.0   68.04  89.5
192176  183.0  117.93  57.0
342705  175.0   61.23  27.0
379327  165.0   77.11  27.0

[100000 rows x 3 columns]

In [7]:
subset.corr()

           HTM4     WTKG3       AGE
HTM4   1.000000  0.474203 -0.093684
WTKG3  0.474203  1.000000  0.021641
AGE   -0.093684  0.021641  1.000000

In [11]:
xs = np.linspace(-1, 1)
ys = xs**2
ys += np.random.normal(0, 0.05, len(xs))
np.corrcoef(xs, ys)

array([[1.        , 0.02503817],
       [0.02503817, 1.        ]])

In [12]:
# Select columns
columns = ['AGE', 'INCOME2', '_VEGESU1']
subset = brfss[columns]

# Compute the correlation matrix
print(subset.corr())

               AGE   INCOME2  _VEGESU1
AGE       1.000000 -0.015158 -0.009834
INCOME2  -0.015158  1.000000  0.119670
_VEGESU1 -0.009834  0.119670  1.000000